1s/ERP/Conf/Catalogs/Лико_Формы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Формы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦветаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКраски</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Пантоны</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УголПоворотаРастра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_УглыПоворотаРастра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоРельсе</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрафаретнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТрафаретныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПолимера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПолимеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказТех</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаливки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистортФлексо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДистортыФлексо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинкс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сплошная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияСФормой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияСФормой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ИсторияДвиженийФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ИсторияДвиженийФорм</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Управляющий</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Коробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Сотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Заказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_УпаковочныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаявкаНаСклад</Name>
					<Comment>Старая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерБобины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_КодПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_ИнформацияОПродукте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_УпотребитьДо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_Roll_ID</Name>
					<Comment>Штрих-код EPSMA Roll ID короткий. (Правай часть от Roll Number)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_Товароместо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_РабочегоЦентра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ПриходРасходТовароместа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ТовароместоUID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаказаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Конверта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_СотрудникаПолныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ВходящихДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Растарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_КартаСнятияПерерасхода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ТипоразмерПаллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета2_0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Формы/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 		
	Если Параметры.Свойство("РабочийЦентр") Тогда
		РабочийЦентр					=Параметры.РабочийЦентр;
		Элементы.РабочийЦентр.Видимость			=Истина;
		Элементы.Конверт.Видимость				=Ложь;
		Элементы.ГруппаФильтр.Видимость			=Ложь;
		ИспользоватьРЦ							=Истина;
		Элементы.ТаблицаФормКонверт.Видимость	=Истина;
	Иначе
		
		Элементы.РабочийЦентр.Видимость			=Ложь;
		Элементы.Конверт.Видимость				=Истина;
		Элементы.ГруппаФильтр.Видимость			=Истина;
		Элементы.ТаблицаФормКонверт.Видимость	=Ложь;
		
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаявкаНаИзготовлениеФорм") Тогда
		Элементы.ЗаказКлиента.Видимость=Истина;		
	КонецЕсли;
	
	
	Если Параметры.Свойство("ВидПечати") Тогда
		ВидПечати=Параметры.ВидПечати;		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаказКлиента") Тогда
		ЗаказКлиента=Параметры.ЗаказКлиента;		
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация=Параметры.Организация;
	КонецЕсли;
	

	
	
	
	
	
	
	
	Если Параметры.Свойство("Конверт") Тогда
		Конверт=Параметры.Конверт;
	КонецЕсли;
	

	
	//ЗаполнитьТаблицуФорм();
	УстановитьПараметрыНаСервере();
	УправлениеЭлементамиФормы();
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	
КонецПроцедуры




&НаКлиенте
Процедура ТаблицаФормВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//ФормыДляПодбора.Получить(ВыбраннаяСтрока).Выбрана = Истина;
	//Если Поле.Имя="ТаблицаФормПересвет" Тогда
	//ТД=Элементы.ТаблицаФорм.ТекущиеДанные;
	//Если ТД<>Неопределено Тогда
	//	ТД.Пересвет=УстановитьПересветСервер(Тд.Форма); 
	//	 
	//КонецЕсли;
	//	
	//Возврат;	
	//КонецЕсли;
	
	Элементы.ТаблицаФорм.ТекущиеДанные.Выбрана= Не Элементы.ТаблицаФорм.ТекущиеДанные.Выбрана;
КонецПроцедуры

Процедура УстановитьПересветСервер(Форма,Пересвет)
  
		ФормаОбъект=Форма.ПолучитьОбъект();
		ФормаОбъект.Пересвет=Пересвет;
		ФормаОбъект.Записать();

	   //Возврат ФормаОбъект.Пересвет;

КонецПроцедуры


&НаСервере
Процедура ПоказатьОстаток(ТекстЗапросаБезИерархии) 	
	//Перем ЗапросОстатков;
	//З = ПолучитьЗапрос(ТекстЗапросаБезИерархии,ЗапросОстатков);
	//ЗапросОстатков.УстановитьПараметр("КодФормыОтборДляПриоритета", КодФормыОтбор);
	////Если ЗначениеЗаполнено(КодФормыОтбор) Тогда
	//ЗапросОстатков.УстановитьПараметр("КодФормыОтбор", "%"+КодФормыОтбор+"%");
	////КонецЕсли;
	////Если ЗначениеЗаполнено(НоменклатураОтбор) Тогда
	//ЗапросОстатков.УстановитьПараметр("НоменклатураОтбор", "%"+НоменклатураОтбор+"%");
	////КонецЕсли;
	////Если ЗначениеЗаполнено(КонтрагентОтбор) Тогда
	//ЗапросОстатков.УстановитьПараметр("КонтрагентОтбор", "%"+КонтрагентОтбор+"%");
	////КонецЕсли;
	//ЗапросОстатков.УстановитьПараметр("ПоРасположению",Ложь);
	//ЗапросОстатков.УстановитьПараметр("Расположение",Конверт); 
	//ЗапросОстатков.УстановитьПараметр("ИспользоватьРЦ",Ложь); 
	//
	//Если ЗначениеЗаполнено(Конверт) Тогда
	//	ЗапросОстатков.УстановитьПараметр("Расположение",Конверт); 
	//	ЗапросОстатков.УстановитьПараметр("ПоРасположению",Истина);
	//	
	//КонецЕсли;
	//
	//Если Не (ЗначениеЗаполнено(КодФормыОтбор) Или
	//	ЗначениеЗаполнено(НоменклатураОтбор) Или 
	//	ЗначениеЗаполнено(КонтрагентОтбор)Или
	//	ЗначениеЗаполнено(Конверт)) Тогда
	//	ЗапросОстатков.УстановитьПараметр("Расположение",Неопределено);
	//	ЗапросОстатков.УстановитьПараметр("ПоРасположению",Истина);
	//	
	//КонецЕсли;
	//
	//
	//
	//Если ИспользоватьРЦ Тогда
	//	ЗапросОстатков.УстановитьПараметр("ИспользоватьРЦ",Истина); 
	//	
	//	ЗапросОстатков.УстановитьПараметр("Расположение",РабочийЦентр);
	//	ЗапросОстатков.УстановитьПараметр("ПоРасположению",Истина);
	//	
	//КонецЕсли;
	//
	//
	//РезультатЗапроса = З.Выполнить();
	//
	//ФормыДляПодбора.Загрузить(РезультатЗапроса.Выгрузить());
	//
КонецПроцедуры //


&НаСервере
Процедура УстановитьПараметрыНаСервере() //+Лико m.shenderov 26.01.2018   
	
	СписокФорм.Параметры.УстановитьЗначениеПараметра("КодФормыОтборДляПриоритета", КодФормыОтбор);
	СписокФорм.Параметры.УстановитьЗначениеПараметра("КодФормыОтбор", ?(ЗначениеЗаполнено(КодФормыОтбор),"%"+КодФормыОтбор+"%",""));
	СписокФорм.Параметры.УстановитьЗначениеПараметра("НоменклатураОтбор", ?(ЗначениеЗаполнено(НоменклатураОтбор),"%"+НоменклатураОтбор+"%",""));
	СписокФорм.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор",?(ЗначениеЗаполнено(КонтрагентОтбор), "%"+КонтрагентОтбор+"%",""));
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Ложь);
	СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",Конверт); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ИспользоватьРЦ",Ложь); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ЗаказКлиента",ЗаказКлиента); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ЕстьЗаказКлиента",ЗначениеЗаполнено(ЗаказКлиента)); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ВидПечати",ВидПечати); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ЕстьВидПечати",ЗначениеЗаполнено(ВидПечати)); 

	СписокФорм.Параметры.УстановитьЗначениеПараметра("Организация",Организация); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ЕстьОрганизация",ЗначениеЗаполнено(Организация)); 


	
	
	Если ЗначениеЗаполнено(Конверт) Тогда
		СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",Конверт); 
		СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Истина);
		
	КонецЕсли;
	УстановитьПараметрВыбранныхФормСервер();	
	//Если Не (ЗначениеЗаполнено(КодФормыОтбор) Или
	//	ЗначениеЗаполнено(НоменклатураОтбор) Или 
	//	ЗначениеЗаполнено(КонтрагентОтбор)Или
	//	ЗначениеЗаполнено(Конверт)) Тогда
	//	СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",Неопределено);
	//	СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Истина);
	//	
	//КонецЕсли;
	
	
	
	Если ИспользоватьРЦ Тогда
		СписокФорм.Параметры.УстановитьЗначениеПараметра("ИспользоватьРЦ",Истина); 
		
		СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",РабочийЦентр);
		СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Истина);
		
	КонецЕсли;  	
	
КонецПроцедуры  //-Лико m.shenderov 26.01.2018
&НаКлиенте
Процедура УстановитьПараметрыНаКлиенте() //+Лико m.shenderov 26.01.2018   
	
	СписокФорм.Параметры.УстановитьЗначениеПараметра("КодФормыОтборДляПриоритета", КодФормыОтбор);
	СписокФорм.Параметры.УстановитьЗначениеПараметра("КодФормыОтбор", ?(ЗначениеЗаполнено(КодФормыОтбор),"%"+КодФормыОтбор+"%",""));
	СписокФорм.Параметры.УстановитьЗначениеПараметра("НоменклатураОтбор", ?(ЗначениеЗаполнено(НоменклатураОтбор),"%"+НоменклатураОтбор+"%",""));
	СписокФорм.Параметры.УстановитьЗначениеПараметра("КонтрагентОтбор", ?(ЗначениеЗаполнено(КонтрагентОтбор), "%"+КонтрагентОтбор+"%",""));
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Ложь);
	СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",Конверт); 
	СписокФорм.Параметры.УстановитьЗначениеПараметра("ИспользоватьРЦ",Ложь); 
	
	Если ЗначениеЗаполнено(Конверт) Тогда
		СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",Конверт); 
		СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Истина);
		
	КонецЕсли;
	
	//Если Не (ЗначениеЗаполнено(КодФормыОтбор) Или
	//	ЗначениеЗаполнено(НоменклатураОтбор) Или 
	//	ЗначениеЗаполнено(КонтрагентОтбор)Или
	//	ЗначениеЗаполнено(Конверт)) Тогда
	//	СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",Неопределено);
	//	СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Истина);
	//	
	//КонецЕсли;
	
	
	
	Если ИспользоватьРЦ Тогда
		СписокФорм.Параметры.УстановитьЗначениеПараметра("ИспользоватьРЦ",Истина); 
		
		СписокФорм.Параметры.УстановитьЗначениеПараметра("Расположение",РабочийЦентр);
		СписокФорм.Параметры.УстановитьЗначениеПараметра("ПоРасположению",Истина);
		
	КонецЕсли;  	
	
КонецПроцедуры  //-Лико m.shenderov 26.01.2018




Процедура УправлениеЭлементамиФормы()
	
	
КонецПроцедуры //УправлениеЭлементамиФормы

// Процедура устанавливает и отключает отборы у списка
&НаСервере
Процедура УстановитьОтключитьБыстрыйОтборДанных(ОбъектДанных, Знач ЗначениеОтбора = "", Знач ИмяОтбораДанных = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ИмяОтбораДанных) тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектДанных.Отбор[ИмяОтбораДанных].Использование = ЗначениеЗаполнено(ЗначениеОтбора);
	Исключение
		// может быть передано поле которого нет в отборах
		Возврат;
	КонецПопытки;
	
	Если ОбъектДанных.Отбор[ИмяОтбораДанных].Использование Тогда
		Попытка
			ОбъектДанных.Отбор[ИмяОтбораДанных].ВидСравнения  = ВидСравнения.Содержит;
		Исключение
			ОбъектДанных.Отбор[ИмяОтбораДанных].ВидСравнения  = ВидСравнения.Равно;
		КонецПопытки;
		ОбъектДанных.Отбор[ИмяОтбораДанных].Значение = ЗначениеОтбора;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокПриПолученииДанных(Элемент, ОформленияСтрок)
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрос(ТекстЗапроса,ЗапросОстатков)
	
	Если ЗапросОстатков=Неопределено Тогда
		ЗапросОстатков = Новый Запрос(ТекстЗапроса);
	КонецЕсли;
	
	Возврат ЗапросОстатков;
	
КонецФункции //ПолучитьЗапрос

Процедура ФормыДляПодбораВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ВыбраннаяСтрока.Выбрана = Истина;
	
КонецПроцедуры

Процедура ДействияФормыОтключитьОтбор(Кнопка)
	
	КодФормыОтбор = "";
	НоменклатураОтбор = "";
	КонтрагентОтбор = "";
	ДополнительныеУсловияЗапроса = "";
	УсловиеЗапросаСкладРабочийЦентр = "";
	ТекстЗапросаБезИерархии="";
	
	СформироватьТекстыЗапросов(ТекстЗапросаБезИерархии,ДополнительныеУсловияЗапроса,УсловиеЗапросаСкладРабочийЦентр);
	ПоказатьОстаток(ТекстЗапросаБезИерархии);
	
	
КонецПроцедуры

Процедура ДействияФормыОбновить(Кнопка)
	
	ДополнительныеУсловияЗапроса = "";
	УсловиеЗапросаСкладРабочийЦентр = "";	
	//ЗаполнитьТаблицуФорм(); 
	
	УстановитьПараметрыНаСервере();
	
КонецПроцедуры


Процедура СформироватьТекстыЗапросов(ТекстЗапросаБезИерархии,ДополнительныеУсловияЗапроса,УсловиеЗапросаСкладРабочийЦентр)
	
	СформироватьДополнительныеУсловияОтбора(ДополнительныеУсловияЗапроса,УсловиеЗапросаСкладРабочийЦентр);
	СформироватьТекстЗапросаБезИерархии(ТекстЗапросаБезИерархии,ДополнительныеУсловияЗапроса);
	
КонецПроцедуры //СформироватьТекстыЗапросов

Процедура СформироватьДополнительныеУсловияОтбора(ДополнительныеУсловияЗапроса,УсловиеЗапросаСкладРабочийЦентр)
	
	////ДополнительныеУсловияЗапроса = "";
	////УсловиеЗапросаСкладРабочийЦентр = "";
	////
	////Если ЗначениеЗаполнено(КодФормыОтбор) Тогда
	////	ДополнительныеУсловияЗапроса = ДополнительныеУсловияЗапроса +
	////	" И
	////	|	Лико_Формы.Код ПОДОБНО &КодФормыОтбор";
	////	
	////КонецЕсли;
	////Если ЗначениеЗаполнено(НоменклатураОтбор) Тогда
	////	ДополнительныеУсловияЗапроса = ДополнительныеУсловияЗапроса +
	////	" И
	////	|	Лико_Формы.Номенклатура.Наименование ПОДОБНО &НоменклатураОтбор";
	////	
	////КонецЕсли;
	////Если ЗначениеЗаполнено(КонтрагентОтбор) Тогда
	////	ДополнительныеУсловияЗапроса = ДополнительныеУсловияЗапроса +
	////	" И
	////	|	Лико_Формы.Контрагент.Наименование ПОДОБНО &КонтрагентОтбор";
	////	
	////КонецЕсли;
	
КонецПроцедуры //СформироватьДополнительныеУсловияОтбора

Процедура СформироватьТекстЗапросаБезИерархии(ТекстЗапросаБезИерархии,ДополнительныеУсловияЗапроса)
	
	ТекстЗапросаБезИерархии =
	"ВЫБРАТЬ
	|	Лико_ИсторияДвиженийФормСрезПоследних.Форма.Ссылка КАК Форма,
	|	Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код КАК Код,
	|	Лико_ИсторияДвиженийФормСрезПоследних.Расположение КАК Расположение,
	|	ЛОЖЬ КАК Выбрана,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Этикетки КАК Номенклатура,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код = &КодФормыОтборДляПриоритета
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВысокаяПриоритетность,
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	Лико_ИсторияДвиженийФормСрезПоследних.Период КАК Дата,
	|	ИсторияВКонверте.Расположение КАК Конверт
	|ИЗ
	|	РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних(
	|			,
	|			ВЫБОР
	|				КОГДА &ПоРасположению
	|					ТОГДА Расположение = &Расположение
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК Лико_ИсторияДвиженийФормСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО (ПОДСТРОКА(Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код, 1, 7) = ЗаказКлиента.НомерБезПрефикса)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних(
	|				,
	|				ВЫБОР
	|					КОГДА &ПоРасположению
	|							И &ИспользоватьРЦ
	|						ТОГДА Расположение ССЫЛКА Справочник.Лико_Конверты
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК ИсторияВКонверте
	|		ПО Лико_ИсторияДвиженийФормСрезПоследних.Форма = ИсторияВКонверте.Форма
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &КодФормыОтбор = """"
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_ИсторияДвиженийФормСрезПоследних.Форма.Код ПОДОБНО &КодФормыОтбор
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НоменклатураОтбор = """"
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиента.Этикетки ПОДОБНО &НоменклатураОтбор
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &КонтрагентОтбор = """"
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЗаказКлиента.Контрагент.Наименование ПОДОБНО &КонтрагентОтбор
	|		КОНЕЦ";
	
	//Если ЗначениеЗаполнено(Конверт) или ИспользоватьРЦ Тогда
	//	
	//	ТекстЗапросаБезИерархии =
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	Лико_Формы.Ссылка КАК ФОрма,
	//	|	Лико_Формы.Код КАК Код,
	//	|	Лико_Формы.Контрагент КАК Контрагент,
	//	|	Лико_ИсторияДвиженийФормСрезПоследних.Расположение КАК Расположение,
	//	|	Лико_Формы.Номенклатура КАК Номенклатура,
	//	|	Лико_Формы.Заказ КАК Заказ,
	//	|	Лико_Формы.Организация КАК Организация,
	//	|	ИСТИНА КАК Выбрана,
	//	|	ВЫБОР
	//	|		КОГДА Лико_Формы.Код = &КодФормыОтборДляПриоритета
	//	|			ТОГДА 1
	//	|		ИНАЧЕ 0
	//	|	КОНЕЦ КАК ВысокаяПриоритетность
	//	|ПОМЕСТИТЬ ВтФормы
	//	|ИЗ
	//	|	Справочник.Лико_Формы КАК Лико_Формы
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияДвиженийФорм.СрезПоследних КАК Лико_ИсторияДвиженийФормСрезПоследних
	//	|		ПО Лико_Формы.Ссылка = Лико_ИсторияДвиженийФормСрезПоследних.Форма
	//	|ГДЕ
	//	|	Лико_ИсторияДвиженийФормСрезПоследних.Расположение = &Расположение
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВтФормы.ФОрма КАК ФОрма,
	//	|	ВтФормы.Код КАК Код,
	//	|	ВтФормы.Контрагент КАК Контрагент,
	//	|	ВтФормы.Расположение КАК Расположение,
	//	|	ВтФормы.Номенклатура КАК Номенклатура,
	//	|	ВтФормы.Заказ КАК Заказ,
	//	|	ВтФормы.Организация КАК Организация,
	//	|	ВтФормы.Выбрана КАК Выбрана,
	//	|	ВтФормы.ВысокаяПриоритетность КАК ВысокаяПриоритетность,
	//	|	МАКСИМУМ(ЗаказКлиентаФормы.Ссылка.Дата) КАК Дата
	//	|ПОМЕСТИТЬ ВтФормаЗаказМаксДата
	//	|ИЗ
	//	|	ВтФормы КАК ВтФормы
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Формы КАК ЗаказКлиентаФормы
	//	|		ПО ВтФормы.ФОрма = ЗаказКлиентаФормы.Значение
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВтФормы.ФОрма,
	//	|	ВтФормы.Код,
	//	|	ВтФормы.Контрагент,
	//	|	ВтФормы.Расположение,
	//	|	ВтФормы.Номенклатура,
	//	|	ВтФормы.Заказ,
	//	|	ВтФормы.Организация,
	//	|	ВтФормы.Выбрана,
	//	|	ВтФормы.ВысокаяПриоритетность
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВтФормаЗаказМаксДата.ФОрма КАК Форма,
	//	|	ВтФормаЗаказМаксДата.Код КАК Код,
	//	|	ВтФормаЗаказМаксДата.Расположение КАК Расположение,
	//	|	ВтФормаЗаказМаксДата.Выбрана КАК Выбрана,
	//	|	ВтФормаЗаказМаксДата.ВысокаяПриоритетность КАК ВысокаяПриоритетность,
	//	|	ВтФормаЗаказМаксДата.Дата КАК Дата,
	//	|	МАКСИМУМ(ЗаказКлиентаФормы.Ссылка.Организация) КАК Организация,
	//	|	МАКСИМУМ(ЗаказКлиентаФормы.Ссылка.Ссылка) КАК Заказ,
	//	|	МАКСИМУМ(ЗаказКлиентаФормы.Ссылка.Контрагент) КАК Контрагент,
	//	|	МАКСИМУМ(ЗаказКлиентаФормы.Ссылка.Этикетки) КАК Номенклатура
	//	|ИЗ
	//	|	ВтФормаЗаказМаксДата КАК ВтФормаЗаказМаксДата
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Формы КАК ЗаказКлиентаФормы
	//	|		ПО ВтФормаЗаказМаксДата.ФОрма = ЗаказКлиентаФормы.Значение
	//	|			И ВтФормаЗаказМаксДата.Дата = ЗаказКлиентаФормы.Ссылка.Дата
	//	|ГДЕ
	//	|	ВЫБОР
	//	|			КОГДА &КодФормыОтбор = """"
	//	|				ТОГДА ИСТИНА
	//	|			ИНАЧЕ ВтФормаЗаказМаксДата.ФОрма.Код ПОДОБНО &КодФормыОтбор
	//	|		КОНЕЦ
	//	|	И ВЫБОР
	//	|			КОГДА &НоменклатураОтбор = """"
	//	|				ТОГДА ИСТИНА
	//	|			ИНАЧЕ ЗаказКлиентаФормы.Ссылка.Этикетки ПОДОБНО &НоменклатураОтбор
	//	|		КОНЕЦ
	//	|	И ВЫБОР
	//	|			КОГДА &КонтрагентОтбор = """"
	//	|				ТОГДА ИСТИНА
	//	|			ИНАЧЕ ЗаказКлиентаФормы.Ссылка.Контрагент.Наименование ПОДОБНО &КонтрагентОтбор
	//	|		КОНЕЦ
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВтФормаЗаказМаксДата.ФОрма,
	//	|	ВтФормаЗаказМаксДата.Код,
	//	|	ВтФормаЗаказМаксДата.Расположение,
	//	|	ВтФормаЗаказМаксДата.Выбрана,
	//	|	ВтФормаЗаказМаксДата.ВысокаяПриоритетность,
	//	|	ВтФормаЗаказМаксДата.Дата";
	//	
	//	
	//КонецЕсли;
	
КонецПроцедуры //СформироватьТекстЗапросаБезИерархии

&НаСервере
Процедура ЗаполнитьТаблицуФорм() 
	
	
	ДополнительныеУсловияЗапроса = "";
	УсловиеЗапросаСкладРабочийЦентр = "";
	ТекстЗапросаБезИерархии="";
	
	СформироватьТекстыЗапросов(ТекстЗапросаБезИерархии,ДополнительныеУсловияЗапроса,УсловиеЗапросаСкладРабочийЦентр);
	ПоказатьОстаток(ТекстЗапросаБезИерархии);
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	Соответствие = Новый Соответствие;
	Массив = Новый Массив();
	
	ВыбранныеФормы=ФормыДляПодбора.НайтиСтроки(Новый Структура("Выбрана",Истина));
	Для каждого Форма Из ФормыДляПодбора Цикл
		Массив.Добавить(Форма.Форма);
		Если ИспользоватьРЦ Тогда
			Соответствие.Вставить(Форма.Форма,Форма.Конверт);
		Иначе
			Соответствие.Вставить(Форма.Форма,Форма.Расположение);
			
		КонецЕсли;
		
		
	КонецЦикла;
	Структура = Новый Структура;
	Структура.Вставить("Массив",Массив);
	Структура.Вставить("Соответствие",Соответствие);
	Закрыть(Структура);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	КодФормыОтбор = "";
	НоменклатураОтбор = "";
	КонтрагентОтбор = "";
	УстановитьПараметрыНаСервере();
	//ЗаполнитьТаблицуФорм(); 
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	//ЗаполнитьТаблицуФорм();
	УправлениеЭлементамиФормы();
	УстановитьПараметрыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КодФормыОтборПриИзменении(Элемент)
	//ЗаполнитьТаблицуФорм();
	УправлениеЭлементамиФормы();
	УстановитьПараметрыНаКлиенте();
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если  ИмяСобытия="АвторизацияОператора" Тогда
		Оператор=ГлЛико_Оператор;   
	КонецЕсли;
	
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Конверта") Тогда
			
			Конверт= Результат.Конверт;
			//ЗаполнитьТаблицуФорм();
			УправлениеЭлементамиФормы();
			УстановитьПараметрыНаСервере();
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПриИзменении(Элемент)
	
	Для каждого Товар Из ФормыДляПодбора Цикл
		Товар.Выбрана=Выбрать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокФормВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ТекФорма=Элементы.СписокФорм.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("Форма",ТекФорма.Форма);
	НайденныеСтроки= ФормыДляПодбора.НайтиСтроки(Структура);
	Если НайденныеСтроки.Количество()=0 Тогда
		
		НоваяФыбраннаяФорма=ФормыДляПодбора.Добавить();
		ЗаполнитьЗначенияСвойств( НоваяФыбраннаяФорма,ТекФорма);
	Иначе
		Для каждого НайденаяСтрока Из НайденныеСтроки Цикл
			ФормыДляПодбора.Удалить(ФормыДляПодбора.Индекс(НайденаяСтрока));
			
		КонецЦикла;
		
	КонецЕсли;
	КоличествоВыбранныхФорм=ФормыДляПодбора.Количество();	
	УстановитьПараметрВыбранныхФорм();	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФормПослеУдаления(Элемент)
	КоличествоВыбранныхФорм=ФормыДляПодбора.Количество();
	УстановитьПараметрВыбранныхФорм();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрВыбранныхФорм() //+Лико m.shenderov 28.10.2018
	Массив = Новый Массив();
	Для каждого Форма Из ФормыДляПодбора Цикл
		Массив.Добавить(Форма.Форма);
	КонецЦикла;
	СписокФорм.Параметры.УстановитьЗначениеПараметра("Формы",Массив);
КонецПроцедуры //-Лико m.shenderov 28.10.2018

&НаСервере
Процедура УстановитьПараметрВыбранныхФормСервер() //+Лико m.shenderov 28.10.2018
	Массив = Новый Массив();
	Для каждого Форма Из ФормыДляПодбора Цикл
		Массив.Добавить(Форма.Форма);
	КонецЦикла;
	СписокФорм.Параметры.УстановитьЗначениеПараметра("Формы",Массив);
КонецПроцедуры //-Лико m.shenderov 28.10.2018

&НаСервере
Процедура ВыбратьВсеНаСервере()
	Если ФормыДляПодбора.Количество()>0 Тогда	
		ФормыДляПодбора.Очистить();
	Иначе
		Тз= Получить_ТЗ_Из_ДинамическогоСписка();
		Если Тз.Количество()>100 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Слишком большой список форм!. Установите отбор форм.";
		Сообщение.Сообщить();	
			Возврат;	
		КонецЕсли;
		
		Для каждого Форма Из Тз Цикл
			Структура = Новый Структура;
			Структура.Вставить("Форма",Форма.Форма);
			НайденныеСтроки= ФормыДляПодбора.НайтиСтроки(Структура);
			Если НайденныеСтроки.Количество()=0 Тогда
				
				НоваяФыбраннаяФорма=ФормыДляПодбора.Добавить();
				ЗаполнитьЗначенияСвойств( НоваяФыбраннаяФорма,Форма);
			КонецЕсли;
					
		КонецЦикла;
	КонецЕсли;
		КоличествоВыбранныхФорм=ФормыДляПодбора.Количество();	

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	ВыбратьВсеНаСервере();
	УстановитьПараметрВыбранныхФорм();	
	
КонецПроцедуры



&НаСервере
Функция Получить_ТЗ_Из_ДинамическогоСписка()
	
	Схема = Элементы.СписокФорм.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокФорм.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Возврат ТЗ;
	
КонецФункции


&НаКлиенте
Процедура ТаблицаФормПересветПриИзменении(Элемент)
	
	ТД=Элементы.ТаблицаФорм.ТекущиеДанные;
	
	Если ТД<>Неопределено Тогда
		УстановитьПересветСервер(Тд.Форма,ТД.Пересвет);		
	КонецЕсли;
	
	

КонецПроцедуры
